{
  "PAD": 0,
  "EOS": 1,
  "BOS": 2,
  "UNK": 3,
  "shift_0": 4,
  "shift_1": 5,
  "shift_2": 6,
  "shift_3": 7,
  "shift_4": 8,
  "shift_5": 9,
  "shift_6": 10,
  "shift_7": 11,
  "shift_8": 12,
  "shift_9": 13,
  "shift_10": 14,
  "shift_11": 15,
  "shift_12": 16,
  "shift_13": 17,
  "shift_14": 18,
  "shift_15": 19,
  "shift_16": 20,
  "shift_17": 21,
  "shift_18": 22,
  "shift_19": 23,
  "shift_20": 24,
  "shift_21": 25,
  "shift_22": 26,
  "shift_23": 27,
  "shift_24": 28,
  "shift_25": 29,
  "shift_26": 30,
  "shift_27": 31,
  "shift_28": 32,
  "shift_29": 33,
  "shift_30": 34,
  "shift_31": 35,
  "shift_32": 36,
  "shift_33": 37,
  "shift_34": 38,
  "shift_35": 39,
  "shift_36": 40,
  "shift_37": 41,
  "shift_38": 42,
  "shift_39": 43,
  "shift_40": 44,
  "shift_41": 45,
  "shift_42": 46,
  "shift_43": 47,
  "shift_44": 48,
  "shift_45": 49,
  "shift_46": 50,
  "shift_47": 51,
  "shift_48": 52,
  "shift_49": 53,
  "shift_50": 54,
  "shift_51": 55,
  "shift_52": 56,
  "shift_53": 57,
  "shift_54": 58,
  "shift_55": 59,
  "shift_56": 60,
  "shift_57": 61,
  "shift_58": 62,
  "shift_59": 63,
  "shift_60": 64,
  "shift_61": 65,
  "shift_62": 66,
  "shift_63": 67,
  "shift_64": 68,
  "shift_65": 69,
  "shift_66": 70,
  "shift_67": 71,
  "shift_68": 72,
  "shift_69": 73,
  "shift_70": 74,
  "shift_71": 75,
  "shift_72": 76,
  "shift_73": 77,
  "shift_74": 78,
  "shift_75": 79,
  "shift_76": 80,
  "shift_77": 81,
  "shift_78": 82,
  "shift_79": 83,
  "shift_80": 84,
  "shift_81": 85,
  "shift_82": 86,
  "shift_83": 87,
  "shift_84": 88,
  "shift_85": 89,
  "shift_86": 90,
  "shift_87": 91,
  "shift_88": 92,
  "shift_89": 93,
  "shift_90": 94,
  "shift_91": 95,
  "shift_92": 96,
  "shift_93": 97,
  "shift_94": 98,
  "shift_95": 99,
  "shift_96": 100,
  "shift_97": 101,
  "shift_98": 102,
  "shift_99": 103,
  "shift_100": 104,
  "shift_101": 105,
  "shift_102": 106,
  "shift_103": 107,
  "shift_104": 108,
  "shift_105": 109,
  "shift_106": 110,
  "shift_107": 111,
  "shift_108": 112,
  "shift_109": 113,
  "shift_110": 114,
  "shift_111": 115,
  "shift_112": 116,
  "shift_113": 117,
  "shift_114": 118,
  "shift_115": 119,
  "shift_116": 120,
  "shift_117": 121,
  "shift_118": 122,
  "shift_119": 123,
  "shift_120": 124,
  "shift_121": 125,
  "shift_122": 126,
  "shift_123": 127,
  "shift_124": 128,
  "shift_125": 129,
  "shift_126": 130,
  "shift_127": 131,
  "shift_128": 132,
  "shift_129": 133,
  "shift_130": 134,
  "shift_131": 135,
  "shift_132": 136,
  "shift_133": 137,
  "shift_134": 138,
  "shift_135": 139,
  "shift_136": 140,
  "shift_137": 141,
  "shift_138": 142,
  "shift_139": 143,
  "shift_140": 144,
  "shift_141": 145,
  "shift_142": 146,
  "shift_143": 147,
  "shift_144": 148,
  "shift_145": 149,
  "shift_146": 150,
  "shift_147": 151,
  "shift_148": 152,
  "shift_149": 153,
  "shift_150": 154,
  "shift_151": 155,
  "shift_152": 156,
  "shift_153": 157,
  "shift_154": 158,
  "shift_155": 159,
  "shift_156": 160,
  "shift_157": 161,
  "shift_158": 162,
  "shift_159": 163,
  "shift_160": 164,
  "shift_161": 165,
  "shift_162": 166,
  "shift_163": 167,
  "shift_164": 168,
  "shift_165": 169,
  "shift_166": 170,
  "shift_167": 171,
  "shift_168": 172,
  "shift_169": 173,
  "shift_170": 174,
  "shift_171": 175,
  "shift_172": 176,
  "shift_173": 177,
  "shift_174": 178,
  "shift_175": 179,
  "shift_176": 180,
  "shift_177": 181,
  "shift_178": 182,
  "shift_179": 183,
  "shift_180": 184,
  "shift_181": 185,
  "shift_182": 186,
  "shift_183": 187,
  "shift_184": 188,
  "shift_185": 189,
  "shift_186": 190,
  "shift_187": 191,
  "shift_188": 192,
  "shift_189": 193,
  "shift_190": 194,
  "shift_191": 195,
  "shift_192": 196,
  "shift_193": 197,
  "shift_194": 198,
  "shift_195": 199,
  "shift_196": 200,
  "shift_197": 201,
  "shift_198": 202,
  "shift_199": 203,
  "shift_200": 204,
  "shift_201": 205,
  "shift_202": 206,
  "shift_203": 207,
  "shift_204": 208,
  "shift_205": 209,
  "string_1_fret_0": 210,
  "string_1_fret_1": 211,
  "string_1_fret_2": 212,
  "string_1_fret_3": 213,
  "string_1_fret_4": 214,
  "string_1_fret_5": 215,
  "string_1_fret_6": 216,
  "string_1_fret_7": 217,
  "string_1_fret_8": 218,
  "string_1_fret_9": 219,
  "string_1_fret_10": 220,
  "string_1_fret_11": 221,
  "string_1_fret_12": 222,
  "string_1_fret_13": 223,
  "string_1_fret_14": 224,
  "string_1_fret_15": 225,
  "string_1_fret_16": 226,
  "string_1_fret_17": 227,
  "string_1_fret_18": 228,
  "string_1_fret_19": 229,
  "string_1_fret_20": 230,
  "string_1_fret_21": 231,
  "string_1_fret_22": 232,
  "string_1_fret_23": 233,
  "string_1_fret_24": 234,
  "string_2_fret_0": 235,
  "string_2_fret_1": 236,
  "string_2_fret_2": 237,
  "string_2_fret_3": 238,
  "string_2_fret_4": 239,
  "string_2_fret_5": 240,
  "string_2_fret_6": 241,
  "string_2_fret_7": 242,
  "string_2_fret_8": 243,
  "string_2_fret_9": 244,
  "string_2_fret_10": 245,
  "string_2_fret_11": 246,
  "string_2_fret_12": 247,
  "string_2_fret_13": 248,
  "string_2_fret_14": 249,
  "string_2_fret_15": 250,
  "string_2_fret_16": 251,
  "string_2_fret_17": 252,
  "string_2_fret_18": 253,
  "string_2_fret_19": 254,
  "string_2_fret_20": 255,
  "string_2_fret_21": 256,
  "string_2_fret_22": 257,
  "string_2_fret_23": 258,
  "string_2_fret_24": 259,
  "string_3_fret_0": 260,
  "string_3_fret_1": 261,
  "string_3_fret_2": 262,
  "string_3_fret_3": 263,
  "string_3_fret_4": 264,
  "string_3_fret_5": 265,
  "string_3_fret_6": 266,
  "string_3_fret_7": 267,
  "string_3_fret_8": 268,
  "string_3_fret_9": 269,
  "string_3_fret_10": 270,
  "string_3_fret_11": 271,
  "string_3_fret_12": 272,
  "string_3_fret_13": 273,
  "string_3_fret_14": 274,
  "string_3_fret_15": 275,
  "string_3_fret_16": 276,
  "string_3_fret_17": 277,
  "string_3_fret_18": 278,
  "string_3_fret_19": 279,
  "string_3_fret_20": 280,
  "string_3_fret_21": 281,
  "string_3_fret_22": 282,
  "string_3_fret_23": 283,
  "string_3_fret_24": 284,
  "string_4_fret_0": 285,
  "string_4_fret_1": 286,
  "string_4_fret_2": 287,
  "string_4_fret_3": 288,
  "string_4_fret_4": 289,
  "string_4_fret_5": 290,
  "string_4_fret_6": 291,
  "string_4_fret_7": 292,
  "string_4_fret_8": 293,
  "string_4_fret_9": 294,
  "string_4_fret_10": 295,
  "string_4_fret_11": 296,
  "string_4_fret_12": 297,
  "string_4_fret_13": 298,
  "string_4_fret_14": 299,
  "string_4_fret_15": 300,
  "string_4_fret_16": 301,
  "string_4_fret_17": 302,
  "string_4_fret_18": 303,
  "string_4_fret_19": 304,
  "string_4_fret_20": 305,
  "string_4_fret_21": 306,
  "string_4_fret_22": 307,
  "string_4_fret_23": 308,
  "string_4_fret_24": 309,
  "string_5_fret_0": 310,
  "string_5_fret_1": 311,
  "string_5_fret_2": 312,
  "string_5_fret_3": 313,
  "string_5_fret_4": 314,
  "string_5_fret_5": 315,
  "string_5_fret_6": 316,
  "string_5_fret_7": 317,
  "string_5_fret_8": 318,
  "string_5_fret_9": 319,
  "string_5_fret_10": 320,
  "string_5_fret_11": 321,
  "string_5_fret_12": 322,
  "string_5_fret_13": 323,
  "string_5_fret_14": 324,
  "string_5_fret_15": 325,
  "string_5_fret_16": 326,
  "string_5_fret_17": 327,
  "string_5_fret_18": 328,
  "string_5_fret_19": 329,
  "string_5_fret_20": 330,
  "string_5_fret_21": 331,
  "string_5_fret_22": 332,
  "string_5_fret_23": 333,
  "string_5_fret_24": 334,
  "string_6_fret_0": 335,
  "string_6_fret_1": 336,
  "string_6_fret_2": 337,
  "string_6_fret_3": 338,
  "string_6_fret_4": 339,
  "string_6_fret_5": 340,
  "string_6_fret_6": 341,
  "string_6_fret_7": 342,
  "string_6_fret_8": 343,
  "string_6_fret_9": 344,
  "string_6_fret_10": 345,
  "string_6_fret_11": 346,
  "string_6_fret_12": 347,
  "string_6_fret_13": 348,
  "string_6_fret_14": 349,
  "string_6_fret_15": 350,
  "string_6_fret_16": 351,
  "string_6_fret_17": 352,
  "string_6_fret_18": 353,
  "string_6_fret_19": 354,
  "string_6_fret_20": 355,
  "string_6_fret_21": 356,
  "string_6_fret_22": 357,
  "string_6_fret_23": 358,
  "string_6_fret_24": 359,
  "accentuated": 360,
  "bend": 361,
  "ghost_note": 362,
  "grace": 363,
  "hammer": 364,
  "harmonic": 365,
  "heavy_accentuated": 366,
  "let_ring": 367,
  "palm_mute": 368,
  "slide_into_from_below": 369,
  "slide_out_downwards": 370,
  "slide_shift": 371,
  "staccato": 372,
  "sustain": 373,
  "tremolo_picking": 374,
  "trill": 375,
  "vibrato": 376
}
